ar = [ "զրո",  'առաջին',  'երկրորդ',  'երրորդ',  'չորորդ',
       'հինգերորդ',  'վեցերորդ',  'յոթերորդ',  'ութերորդ',  'իններորդ',
       'տասներորդ',  'տասնմեկերորդ',  'տասներկուերորդ',  'տասներեքերորդ',
       'տասնչորսերորդ',  'տասնհինգերորդ',  'տասնվեցերորդ',  'տասնյոթերորդ',
       'տասնութերորդ',  'տսնիներորդ',  'քսաներորդ',  'քսանմեկերորդ' ]
tiv = int (input('մուտքագրեք տարեթիվը '))
dar = (tiv-1) // 100 +1
print (tiv , 'տարին ', dar, 'րդ դարում է')
print (tiv , 'տարին ', ar[dar], ' դարում է')